1s/ERP/extensions/liko/Enums/ЯС_ВидыШК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЯС_ВидыШК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШК_Паллета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШК_Адреса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШК_ОбъектаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШК_ЗаявкаНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШК_ОбъектаНоменклатуры_Короткий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/extensions/liko/Catalogs/ЯССМ_ОбъектыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЯССМ_ОбъектыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Нарезка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Втулка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Втулки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Уникальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмеренияУУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Рулонный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаименованиеКороткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КодНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Категория2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КатегорияТовара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерБланка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаФормирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УпотребитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидКонтактаСПищевойПродукцией</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыКонтактовСПищевойПродукцией</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОстаточныйСрокГодности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/extensions/liko/CommonForms/Лико_РасчетДлиныРолика/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);

	
	Если Параметры.Свойство("Номенклатура") Тогда
		Номенклатура=Параметры.Номенклатура;
	КонецЕсли;
	
	Если Параметры.Свойство("РедактироватьТолщину") Тогда
		РедактироватьТолщину=Параметры.РедактироватьТолщину;
	КонецЕсли;
	
	Если Параметры.Свойство("ВозвращатьЗначение") Тогда
		ВозвращатьЗначение=Параметры.ВозвращатьЗначение;
	КонецЕсли;
	
	Если Параметры.Свойство("НачальныйДиаметр") Тогда
		НачальныйДиаметр=Параметры.НачальныйДиаметр;
	КонецЕсли;
	Если Параметры.Свойство("РежимБезРедактированияМетров") Тогда
		РежимБезРедактированияМетров=Параметры.РежимБезРедактированияМетров;
	КонецЕсли;
	
		 //+ Лико m.shenderov 26.03.2018 	
	  	   РедактироватьТолщину=Истина;
	   //- Лико m.shenderov 26.03.2018
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	
	Элементы.ТолщинаМатериала.Доступность = РедактироватьТолщину;	
	ДлинаРолика = 0; 
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Структура = Новый Структура; 
	Структура.Вставить("ДлинаРолика", ДлинаРолика);
	
	ЭтаФорма.Закрыть(Структура);
	
КонецПроцедуры

&НаКлиенте
Функция РассчитатьДлинуРолика(ТолщинаМатериала, НачальныйДиаметр, КонечныйДиаметр)
	
	Длина = 0;
	
	Если ТолщинаМатериала=0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Если НачальныйДиаметр=0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Если КонечныйДиаметр<НачальныйДиаметр Тогда
		Возврат 0;
	КонецЕсли;
	
	Pi = 3.14159;
	s_1000 = ТолщинаМатериала / 1000;
	
	r0 = НачальныйДиаметр / 2; // НачальныйРадиус
	r  = КонечныйДиаметр  / 2; // КонечныйРадиус
	
	h = r - r0;
	hs = h + s_1000;
	h2s = h + 2 * s_1000;
	
	Длина = (Pi * (2*r0*h + hs*h2s) / s_1000) / 1000;
	
	Длина = Окр(Длина, 0);
	
	Возврат Длина;
	УправлениеЭлементамиФормы();
	
КонецФункции //РассчитатьДлинуРолика


&НаКлиенте
Процедура Рассчитать(Команда)
	ДлинаРолика = РассчитатьДлинуРолика(ТолщинаМатериала, НачальныйДиаметр, КонечныйДиаметр);
	УправлениеЭлементамиФормы();
	
КонецПроцедуры


&НаКлиенте
Процедура НачальныйДиаметрПриИзменении(Элемент)
	ДлинаРолика = РассчитатьДлинуРолика(ТолщинаМатериала, НачальныйДиаметр, КонечныйДиаметр);
	УправлениеЭлементамиФормы();
	
КонецПроцедуры


&НаКлиенте
Процедура КонечныйДиаметрПриИзменении(Элемент)
	ДлинаРолика = Окр(РассчитатьДлинуРолика(ТолщинаМатериала, НачальныйДиаметр, КонечныйДиаметр), -1, РежимОкругления.Окр15как10);
	УправлениеЭлементамиФормы();
	
КонецПроцедуры


&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	
	
	// Юдников
	Если Не РедактироватьТолщину 
		ИЛИ ТолщинаМатериала = 0 Тогда
		ТолщинаМатериала= ПолучитьТолщинуМатериала(Номенклатура);
	КонецЕсли;
	
	// Отображение сообщения на форме
	Сообщение = "";
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Сообщение = "Выберите материал.";
	ИначеЕсли Не ЗначениеЗаполнено(ТолщинаМатериала) Тогда
		Сообщение = "У материала не установлена толщина!";
	ИначеЕсли Не ЗначениеЗаполнено(НачальныйДиаметр) Тогда
		Сообщение = "Задайте начальный диаметр.";
	ИначеЕсли Не ЗначениеЗаполнено(КонечныйДиаметр) Тогда
		Сообщение = "Задайте конечный диаметр.";
	КонецЕсли;
	Элементы.НадписьСообщение.Заголовок = Сообщение;
	Элементы.НадписьСообщение.Видимость = ЗначениеЗаполнено(Сообщение);
	
	//Элементы.ОсновныеДействияФормы.Кнопки.Действие.Доступность = ВозвращатьЗначение;
	
	Если РежимБезРедактированияМетров Тогда
		Элементы.Номенклатура.Доступность = Ложь;
		Элементы.ДлинаРолика.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры //УправлениеЭлементамиФормы

&НаСервереБезКонтекста
Функция ПолучитьТолщинуМатериала(Номенклатура) //+Лико m.shenderov 12.09.2017
	Размер=Номенклатура.Лико_ТолщинаМатериала;
	Если Не ЗначениеЗаполнено(Размер) Тогда
		Размер=Номенклатура.ВидНоменклатуры.Лико_ТолщинаМатериала;
	КонецЕсли;

	
	Возврат Размер;
КонецФункции //ПолучитьТолщинуМатериала -Лико m.shenderov 12.09.2017


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование

КонецПроцедуры



&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	
	
	
	Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода.Штрихкод);
	Если Результат.Ошибка <> "" Тогда
				
			Сообщить(Результат.Ошибка);
		
		
	Иначе
			Если Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры_Короткий") Или 			
			Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры") Тогда
			
			
			Если Не ЗначениеЗаполнено(Результат.ОбъектНоменклатуры) Тогда
				
				Сообщить("Штрих код не найден! "+ Результат.ШК);
				Возврат;	
			КонецЕсли;
			
			ОбработатьШКНоменклатуры(Результат.ОбъектНоменклатуры);
			
			КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьШКНоменклатуры(ОбъектНоменклатуры)  //+Лико m.shenderov 03.11.2018
Номенклатура=ОбъектНоменклатуры.Номенклатура;
НачальныйДиаметр=РазмерНаружногоДиаметра(ОбъектНоменклатуры);	
КонецПроцедуры  //-Лико m.shenderov 03.11.2018



&НаСервереБезКонтекста
Функция РазмерНаружногоДиаметра(ОбъектНоменклатуры) //+Лико m.shenderov 12.09.2017
	РазмерНаружногоДиаметра=0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектНоменклатуры.Втулка.РазмерНаружногоДиаметра КАК Размер
	|ИЗ
	|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ОбъектНоменклатуры
	|ГДЕ
	|	ОбъектНоменклатуры.Ссылка = &ОбъектНоменклатуры";
	Запрос.УстановитьПараметр("ОбъектНоменклатуры",ОбъектНоменклатуры );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		РазмерНаружногоДиаметра=Выборка.Размер;
	КонецЦикла; 
	Возврат РазмерНаружногоДиаметра;
	
КонецФункции //РазмерНаружногоДиаметра -Лико m.shenderov 12.09.2017

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	ТолщинаМатериала=0;
	УправлениеЭлементамиФормы();


КонецПроцедуры
